function d = Calibration_Lframe_LM2_lm4pt(x, xyzC, Lxyz)
% 在得到4个点在相机坐标系下的坐标后，用L型框架的约束条件做一次LM优化的目标函数，用于调整4个点的坐标。
% 所用到的约束条件有：
% 1. 4个点之间的距离；
% 2. 1）四个点都在OP_i射线上；2）1,2,3号点比例共线；
% 3. P4P1 垂直于 P1P2, P1P3, P2P3 .
% 一共26个方程，在目标函数中，将第1部分约束权值加大，可以得到比以前好的效果。
% 输入：
% x     1*12     L型框架上四个点在相机坐标系下的坐标，按顺序排成一行. [ x1 y1 z1 x2 y2 z2 x3 y3 z3 x4 y4 z4 ] 
% xyzC  4*3      L型框架上四个点在归一化平面上的坐标，一行表示一个点的坐标（z=1）. [ x y 1 ] 
% Lxyz  4*3      L型框架上四个点在世界坐标系下的坐标，一行表示一个点的坐标. [ x y z ] 
% 输出：最小二乘方法中的求和项，理想情况下有 d(i)=0 .

% xyzC =[
%    0.067985187966913   0.195717726274982   1.000000000000000
%    0.066622629957160   0.157654787086245   1.000000000000000
%    0.064295466900847   0.092643660162677   1.000000000000000
%   -0.059236541965606   0.180997535670956   1.000000000000000
% ];

% xyzC = importdata('input\xyzC.txt') ; 

x = x(:) ; 
P = reshape(x,3,4) ;  
P = P' ; % P 4*3, 每一行代表一个点的xyz坐标

L12 = sqrt( (Lxyz(2,1)-Lxyz(1,1))^2 + (Lxyz(2,2)-Lxyz(1,2))^2 + (Lxyz(2,3)-Lxyz(1,3))^2 ) ; %世界坐标系下1号点与2号点间的距离
L13 = sqrt( (Lxyz(3,1)-Lxyz(1,1))^2 + (Lxyz(3,2)-Lxyz(1,2))^2 + (Lxyz(3,3)-Lxyz(1,3))^2 ) ; %世界坐标系下1号点与3号点间的距离
L14 = sqrt( (Lxyz(4,1)-Lxyz(1,1))^2 + (Lxyz(4,2)-Lxyz(1,2))^2 + (Lxyz(4,3)-Lxyz(1,3))^2 ) ; %世界坐标系下1号点与4号点间的距离
L23 = sqrt( (Lxyz(3,1)-Lxyz(2,1))^2 + (Lxyz(3,2)-Lxyz(2,2))^2 + (Lxyz(3,3)-Lxyz(2,3))^2 ) ; %世界坐标系下2号点与3号点间的距离
L24 = sqrt( (Lxyz(4,1)-Lxyz(2,1))^2 + (Lxyz(4,2)-Lxyz(2,2))^2 + (Lxyz(4,3)-Lxyz(2,3))^2 ) ; %世界坐标系下2号点与4号点间的距离
L34 = sqrt( (Lxyz(3,1)-Lxyz(4,1))^2 + (Lxyz(3,2)-Lxyz(4,2))^2 + (Lxyz(3,3)-Lxyz(4,3))^2 ) ; %世界坐标系下3号点与4号点间的距离

d = zeros(20,1) ; 

% 1. 四个点两两之间的距离
d(1) = sqrt((P(2,:)-P(1,:))*(P(2,:)-P(1,:)).') - L12 ; % 1 2 号点之间的距离为200
d(2) = sqrt((P(3,:)-P(1,:))*(P(3,:)-P(1,:)).') - L13 ; % 1 3 号点之间的距离为600
d(3) = sqrt((P(4,:)-P(1,:))*(P(4,:)-P(1,:)).') - L14 ; % 1 4 号点之间的距离为400
d(4) = sqrt((P(3,:)-P(2,:))*(P(3,:)-P(2,:)).') - L23 ; % 2 3 号点之间的距离为400
d(5) = sqrt((P(4,:)-P(2,:))*(P(4,:)-P(2,:)).') - L24 ; % 2 4 号点之间的距离为sqrt(200^2+400^2)
d(6) = sqrt((P(4,:)-P(3,:))*(P(4,:)-P(3,:)).') - L34 ; % 3 4 号点之间的距离为sqrt(600^2+400^2)

% 2.1 四个点都在OP_i射线上
A = zeros(11,12) ;

for i=1:4
    A(i*2-1, 1+3*(i-1)) = 1 ;
    A(i*2-1, 3*i)       = -xyzC(i,1) ;
    A(i*2  , 2+3*(i-1)) = 1 ;
    A(i*2  , 3*i)       = -xyzC(i,2) ;
end
% 2.2 1,2,3号点比例共线
A(9:11,1:3) = (L13 - L12)*eye(3) ;
A(9:11,4:6) = -L13*eye(3) ;
A(9:11,7:9) = L12*eye(3) ;

d(7:17) = A*x ;

% 3. P4P1 垂直于 P1P2, P1P3, P2P3
d(18) = ((P(4,:)-P(1,:))*(P(2,:)-P(1,:))')/(norm(P(4,:)-P(1,:))*norm(P(2,:)-P(1,:))) ;
d(19) = ((P(4,:)-P(1,:))*(P(3,:)-P(1,:))')/(norm(P(4,:)-P(1,:))*norm(P(3,:)-P(1,:))) ;
d(20) = ((P(4,:)-P(1,:))*(P(3,:)-P(2,:))')/(norm(P(4,:)-P(1,:))*norm(P(3,:)-P(2,:))) ;

end % lm4pt end
